[
  {
    "slug": "what-is-falafel-what-is-it-made-from-which-cuisine",
    "title": "Istanbul Mediterranean Las Vegas: What Customers Say About the Falafel & More",
    "date": "2024-12-15",
    "excerpt": "Discover why Istanbul Mediterranean's falafel has earned rave reviews from Vegas locals and tourists alike. Real customer feedback reveals what makes this #1 Turkish restaurant's falafel a fan favorite.",
    "cover": "/istanbul-exterior.jpeg"
  },
  {
    "slug": "explore-the-mediterranean-cuisine",
    "title": "Explore the Mediterranean Cuisine",
    "date": "2024-01-25",
    "excerpt": "Journey through the diverse and healthy world of Mediterranean cuisine, discovering the flavors, traditions, and health benefits of this beloved culinary style.",
    "cover": "/istanbul-hero.png"
  },
  {
    "slug": "what-makes-real-baklava-a-guide-to-its-essential-components",
    "title": "What Makes Real Baklava: A Guide to Its Essential Components",
    "date": "2024-01-18",
    "excerpt": "Learn what distinguishes authentic baklava from imitations, exploring the essential ingredients and techniques that create this masterpiece.",
    "cover": "/baklava.jpg"
  },
  {
    "slug": "the-ultimate-guide-to-savoring-the-perfect-gyro",
    "title": "The Ultimate Guide to Savoring the Perfect Gyro",
    "date": "2024-01-15",
    "excerpt": "Discover the secrets to enjoying an authentic gyro experience, from traditional preparation to perfect accompaniments.",
    "cover": "/gyros.png"
  },
  {
    "slug": "baklava-unwrapped",
    "title": "Baklava Unwrapped",
    "date": "2024-01-12",
    "excerpt": "Dive deep into the layers of history, technique, and flavor that make baklava one of the world's most beloved desserts.",
    "cover": "/baklava.jpg"
  },
  {
    "slug": "shawarma-vs-doner-kebab",
    "title": "Shawarma vs Döner Kebab",
    "date": "2024-01-08",
    "excerpt": "Discover the differences and similarities between shawarma and döner kebab, two beloved Middle Eastern dishes that often get confused.",
    "cover": "/shawarma-vs-doner.jpg"
  },
  {
    "slug": "halal-what-does-it-mean",
    "title": "Halal: What Does It Mean?",
    "date": "2024-01-05",
    "excerpt": "A comprehensive guide to understanding halal food, its significance, and what it means for Mediterranean and Middle Eastern cuisine.",
    "cover": "/halal-vegan.png"
  }
]